joristork/robots/jobot_in_c/microchip_extras/h/p18f4431.h
extern volatile near unsigned char       TRISE;
extern volatile near union {
  struct {
    unsigned TRISE0:1;
    unsigned TRISE1:1;
    unsigned TRISE2:1;
  };
  struct {
    unsigned RE0:1;
    unsigned RE1:1;
    unsigned RE2:1;
  };
} TRISEbits;
extern volatile near unsigned char       ADCHS;
extern volatile near union {
  struct {
    unsigned SASEL:2;
    unsigned SCSEL:2;
    unsigned SBSEL:2;
    unsigned SDSEL:2;
  };
  struct {
    unsigned GASEL0:1;
    unsigned GASEL1:1;
    unsigned GCSEL0:1;
    unsigned GCSEL1:1;
    unsigned GBSEL0:1;
    unsigned GBSEL1:1;
    unsigned GDSEL0:1;
    unsigned GDSEL1:1;
  };
  struct {
    unsigned SASEL0:1;
    unsigned SASEL1:1;
    unsigned SCSEL0:1;
    unsigned SCSEL1:1;
    unsigned SBSEL0:1;
    unsigned SBSEL1:1;
    unsigned SDSEL0:1;
    unsigned SDSEL1:1;
  };
} ADCHSbits;
extern volatile near unsigned char       ADCON3;
extern volatile near union {
  struct {
    unsigned SSRC:5;
    unsigned :1;
    unsigned ADRS:2;
  };
  struct {
    unsigned SSRC0:1;
    unsigned SSRC1:1;
    unsigned SSRC2:1;
    unsigned SSRC3:1;
    unsigned SSRC4:1;
    unsigned :1;
    unsigned ADRS0:1;
    unsigned ADRS1:1;
  };
} ADCON3bits;
extern volatile near unsigned char       OSCTUNE;
extern volatile near union {
  struct {
    unsigned TUN:6;
  };
  struct {
    unsigned TUN0:1;
    unsigned TUN1:1;
    unsigned TUN2:1;
    unsigned TUN3:1;
    unsigned TUN4:1;
    unsigned TUN5:1;
  };
} OSCTUNEbits;
extern volatile near unsigned char       PIE1;
extern volatile near union {
  struct {
    unsigned TMR1IE:1;
    unsigned TMR2IE:1;
    unsigned CCP1IE:1;
    unsigned SSPIE:1;
    unsigned TXIE:1;
    unsigned RCIE:1;
    unsigned ADIE:1;
  };
  struct {
    unsigned :4;
    unsigned TBIE:1;
  };
} PIE1bits;
extern volatile near unsigned char       PIR1;
extern volatile near union {
  struct {
    unsigned TMR1IF:1;
    unsigned TMR2IF:1;
    unsigned CCP1IF:1;
    unsigned SSPIF:1;
    unsigned TXIF:1;
    unsigned RCIF:1;
    unsigned ADIF:1;
  };
  struct {
    unsigned :4;
    unsigned TBIF:1;
  };
} PIR1bits;
extern volatile near unsigned char       IPR1;
extern volatile near union {
  struct {
    unsigned TMR1IP:1;
    unsigned TMR2IP:1;
    unsigned CCP1IP:1;
    unsigned SSPIP:1;
    unsigned TXIP:1;
    unsigned RCIP:1;
    unsigned ADIP:1;
  };
  struct {
    unsigned :4;
    unsigned TBIP:1;
  };
} IPR1bits;
extern volatile near unsigned char       PIE2;
extern volatile near struct {
  unsigned CCP2IE:1;
  unsigned :1;
  unsigned LVDIE:1;
  unsigned :1;
  unsigned EEIE:1;
  unsigned :2;
  unsigned OSFIE:1;
} PIE2bits;
extern volatile near unsigned char       PIR2;
extern volatile near struct {
  unsigned CCP2IF:1;
  unsigned :1;
  unsigned LVDIF:1;
  unsigned :1;
  unsigned EEIF:1;
  unsigned :2;
  unsigned OSFIF:1;
} PIR2bits;
extern volatile near unsigned char       IPR2;
extern volatile near struct {
  unsigned CCP2IP:1;
  unsigned :1;
  unsigned LVDIP:1;
  unsigned :1;
  unsigned EEIP:1;
  unsigned :2;
  unsigned OSFIP:1;
} IPR2bits;
extern volatile near unsigned char       PIE3;
extern volatile near struct {
  unsigned TMR5IE:1;
  unsigned IC1IE:1;
  unsigned IC2QEIE:1;
  unsigned IC3DRIE:1;
  unsigned PTIE:1;
} PIE3bits;
extern volatile near unsigned char       PIR3;
extern volatile near struct {
  unsigned TMR5IF:1;
  unsigned IC1IF:1;
  unsigned IC2QEIF:1;
  unsigned IC3DRIF:1;
  unsigned PTIF:1;
} PIR3bits;
extern volatile near unsigned char       IPR3;
extern volatile near struct {
  unsigned TMR5IP:1;
  unsigned IC1IP:1;
  unsigned IC2QEIP:1;
  unsigned IC3DRIP:1;
  unsigned PTIP:1;
} IPR3bits;
extern volatile near unsigned char       EECON1;
extern volatile near struct {
  unsigned RD:1;
  unsigned WR:1;
  unsigned WREN:1;
  unsigned WRERR:1;
  unsigned FREE:1;
  unsigned :1;
  unsigned CFGS:1;
  unsigned EEPGD:1;
} EECON1bits;
extern volatile near unsigned char       EECON2;
extern volatile near unsigned char       EEDATA;
extern volatile near unsigned char       EEADR;
extern volatile near unsigned char       BAUDCON;
extern volatile near union {
  struct {
    unsigned ABDEN:1;
    unsigned WUE:1;
    unsigned :1;
    unsigned BRG16:1;
    unsigned TXCKP:1;
    unsigned RXDTP:1;
    unsigned RCIDL:1;
    unsigned ABDOVF:1;
  };
  struct {
    unsigned :4;
    unsigned SCKP:1;
    unsigned :1;
    unsigned RCMT:1;
  };
} BAUDCONbits;
extern volatile near unsigned char       BAUDCTL;
extern volatile near union {
  struct {
    unsigned ABDEN:1;
    unsigned WUE:1;
    unsigned :1;
    unsigned BRG16:1;
    unsigned TXCKP:1;
    unsigned RXDTP:1;
    unsigned RCIDL:1;
    unsigned ABDOVF:1;
  };
  struct {
    unsigned :4;
    unsigned SCKP:1;
    unsigned :1;
    unsigned RCMT:1;
  };
} BAUDCTLbits;
extern volatile near unsigned char       RCSTA;
extern volatile near union {
  struct {
    unsigned RX9D:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned ADDEN:1;
    unsigned CREN:1;
    unsigned SREN:1;
    unsigned RX9:1;
    unsigned SPEN:1;
  };
  struct {
    unsigned :3;
    unsigned ADEN:1;
  };
} RCSTAbits;
extern volatile near unsigned char       TXSTA;
extern volatile near struct {
  unsigned TX9D:1;
  unsigned TRMT:1;
  unsigned BRGH:1;
  unsigned SENDB:1;
  unsigned SYNC:1;
  unsigned TXEN:1;
  unsigned TX9:1;
  unsigned CSRC:1;
} TXSTAbits;
extern volatile near unsigned char       TXREG;
extern volatile near unsigned char       RCREG;
extern volatile near unsigned char       SPBRG;
extern volatile near unsigned char       SPBRGH;
extern volatile near unsigned char       QEICON;
extern volatile near union {
  struct {
    unsigned PDEC:2;
    unsigned QEIM:3;
    unsigned UP_NOT_DOWN:1;
    unsigned ERROR:1;
    unsigned NOT_VELM:1;
  };
  struct {
    unsigned PDEC0:1;
    unsigned PDEC1:1;
    unsigned QEIM0:1;
    unsigned QEIM1:1;
    unsigned QEIM2:1;
    unsigned UP_DOWN:1;
    unsigned :1;
    unsigned VELM:1;
  };
  struct {
    unsigned :5;
    unsigned UP:1;
  };
  struct {
    unsigned :5;
    unsigned DOWN:1;
  };
  struct {
    unsigned :5;
    unsigned NOT_DOWN:1;
  };
} QEICONbits;
extern volatile near unsigned char       T5CON;
extern volatile near union {
  struct {
    unsigned TMR5ON:1;
    unsigned TMR5CS:1;
    unsigned NOT_T5SYNC:1;
    unsigned T5PS:2;
    unsigned T5MOD:1;
    unsigned NOT_RESEN:1;
    unsigned T5SEN:1;
  };
  struct {
    unsigned :2;
    unsigned T5SYNC:1;
    unsigned T5PS0:1;
    unsigned T5PS1:1;
    unsigned :1;
    unsigned RESEN:1;
  };
} T5CONbits;
