joristork/robots/jobot_in_c/microchip_extras/h/p18f4431.h
#define _FCMEN_OFF_1H        0xBF
#define _FCMEN_ON_1H         0xFF

#define _IESO_OFF_1H         0x7F
#define _IESO_ON_1H          0xFF

/*-------------------------------------------------------------------------
 *   CONFIG2L (0x300002)
 *-------------------------------------------------------------------------*/
#define _CONFIG2L_DEFAULT    0x0F
#define _PWRTEN_ON_2L        0xFE
#define _PWRTEN_OFF_2L       0xFF

#define _BOREN_OFF_2L        0xFD
#define _BOREN_ON_2L         0xFF

#define _BORV_45_2L          0xF3
#define _BORV_42_2L          0xF7
#define _BORV_27_2L          0xFB
#define _BORV_20_2L          0xFF

/*-------------------------------------------------------------------------
 *   CONFIG2H (0x300003)
 *-------------------------------------------------------------------------*/
#define _CONFIG2H_DEFAULT    0x3F
#define _WDTEN_OFF_2H        0xFE
#define _WDTEN_ON_2H         0xFF

#define _WDPS_1_2H           0xE1
#define _WDPS_2_2H           0xE3
#define _WDPS_4_2H           0xE5
#define _WDPS_8_2H           0xE7
#define _WDPS_16_2H          0xE9
#define _WDPS_32_2H          0xEB
#define _WDPS_64_2H          0xED
#define _WDPS_128_2H         0xEF
#define _WDPS_256_2H         0xF1
#define _WDPS_512_2H         0xF3
#define _WDPS_1024_2H        0xF5
#define _WDPS_2048_2H        0xF7
#define _WDPS_4096_2H        0xF9
#define _WDPS_8192_2H        0xFB
#define _WDPS_16384_2H       0xFD
#define _WDPS_32768_2H       0xFF

#define _WINEN_ON_2H         0xDF
#define _WINEN_OFF_2H        0xFF

/*-------------------------------------------------------------------------
 *   CONFIG3L (0x300004)
 *-------------------------------------------------------------------------*/
#define _CONFIG3L_DEFAULT    0x3C
#define _PWMPIN_ON_3L        0xFB
#define _PWMPIN_OFF_3L       0xFF

#define _LPOL_LOW_3L         0xF7
#define _LPOL_HIGH_3L        0xFF

#define _HPOL_LOW_3L         0xEF
#define _HPOL_HIGH_3L        0xFF

#define _T1OSCMX_OFF_3L      0xDF
#define _T1OSCMX_ON_3L       0xFF

/*-------------------------------------------------------------------------
 *   CONFIG3H (0x300005)
 *-------------------------------------------------------------------------*/
#define _CONFIG3H_DEFAULT    0x9D
#define _FLTAMX_RD4_3H       0xFE
#define _FLTAMX_RC1_3H       0xFF

#define _SSPMX_RD1_3H        0xFB
#define _SSPMX_RC7_3H        0xFF

#define _PWM4MX_RD5_3H       0xF7
#define _PWM4MX_RB5_3H       0xFF

#define _EXCLKMX_RD0_3H      0xEF
#define _EXCLKMX_RC3_3H      0xFF

#define _MCLRE_OFF_3H        0x7F
#define _MCLRE_ON_3H         0xFF

/*-------------------------------------------------------------------------
 *   CONFIG4L (0x300006)
 *-------------------------------------------------------------------------*/
#define _CONFIG4L_DEFAULT    0x85
#define _STVREN_OFF_4L       0xFE
#define _STVREN_ON_4L        0xFF

#define _LVP_OFF_4L          0xFB
#define _LVP_ON_4L           0xFF

#define _DEBUG_ON_4L         0x7F
#define _DEBUG_OFF_4L        0xFF

/*-------------------------------------------------------------------------
 *   CONFIG5L (0x300008)
 *-------------------------------------------------------------------------*/
#define _CONFIG5L_DEFAULT    0x0F
#define _CP0_ON_5L           0xFE
#define _CP0_OFF_5L          0xFF

#define _CP1_ON_5L           0xFD
#define _CP1_OFF_5L          0xFF

#define _CP2_ON_5L           0xFB
#define _CP2_OFF_5L          0xFF

#define _CP3_ON_5L           0xF7
#define _CP3_OFF_5L          0xFF

/*-------------------------------------------------------------------------
 *   CONFIG5H (0x300009)
 *-------------------------------------------------------------------------*/
#define _CONFIG5H_DEFAULT    0xC0
#define _CPB_ON_5H           0xBF
#define _CPB_OFF_5H          0xFF

#define _CPD_ON_5H           0x7F
#define _CPD_OFF_5H          0xFF

/*-------------------------------------------------------------------------
 *   CONFIG6L (0x30000a)
 *-------------------------------------------------------------------------*/
#define _CONFIG6L_DEFAULT    0x0F
#define _WRT0_ON_6L          0xFE
#define _WRT0_OFF_6L         0xFF

#define _WRT1_ON_6L          0xFD
#define _WRT1_OFF_6L         0xFF

#define _WRT2_ON_6L          0xFB
#define _WRT2_OFF_6L         0xFF

#define _WRT3_ON_6L          0xF7
#define _WRT3_OFF_6L         0xFF

/*-------------------------------------------------------------------------
 *   CONFIG6H (0x30000b)
 *-------------------------------------------------------------------------*/
#define _CONFIG6H_DEFAULT    0xE0
#define _WRTC_ON_6H          0xDF
#define _WRTC_OFF_6H         0xFF

#define _WRTB_ON_6H          0xBF
#define _WRTB_OFF_6H         0xFF

#define _WRTD_ON_6H          0x7F
#define _WRTD_OFF_6H         0xFF

/*-------------------------------------------------------------------------
 *   CONFIG7L (0x30000c)
 *-------------------------------------------------------------------------*/
#define _CONFIG7L_DEFAULT    0x0F
#define _EBTR0_ON_7L         0xFE
#define _EBTR0_OFF_7L        0xFF

#define _EBTR1_ON_7L         0xFD
#define _EBTR1_OFF_7L        0xFF

#define _EBTR2_ON_7L         0xFB
#define _EBTR2_OFF_7L        0xFF

#define _EBTR3_ON_7L         0xF7
#define _EBTR3_OFF_7L        0xFF

/*-------------------------------------------------------------------------
 *   CONFIG7H (0x30000d)
 *-------------------------------------------------------------------------*/
#define _CONFIG7H_DEFAULT    0x40
#define _EBTRB_ON_7H         0xBF
#define _EBTRB_OFF_7H        0xFF


#endif
